// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
int numberA = 3;
int numberB = 5;
int numberC = 8;
if (numberA > numberB)
Console.WriteLine(numberA);
