// напишите программу: деление одного числа на другое

double numberA = 12;
double numberB = 5;
Console.WriteLine(numberA / numberB);